#include <stdio.h>



/*===================================*/
/*--------------Main-----------------*/
/*===================================*/
int main()
{
  int n;
  double x,a,
         zn=0,               /*значение многочлена в точке х*/
         p=0,
         pp=0,               /*значение производной в точке х*/
         i=0;                /*значение интеграла в точке х*/
  if (scanf("%d", &n) == 0)  /*проверка на пустой ввод*/
    return 0;
  if (scanf("%lf", &x) == 0)
    return 1;
  while (scanf("%lf", &a) == 1)
  {
    zn = x*zn + a;
    pp=p;
    p = x*p + zn;
    i = x*i + a/(n+1);
    n--;
  }
  i *= x;
  /*printf("f(x)=%.10g\nf'(x)=%.10g\nF(x)=%.10g\n", zn, p, i);*/
  printf("%.10g\n%.10g\n%.10g\n", zn, pp, i);
}
