#include <stdio.h>



/*===================================*/
/*--------------Main-----------------*/
/*===================================*/
int main()
{
  double x,a,
         zn=0,                  /*значение многочлена в точке х*/
         p=0,
         pp=0;                  /*значение производной многочлена в точке х*/
  if (scanf("%lf", &x) == 0)    /*проверка на пустой ввод*/
    return 0;
  while (scanf("%lf", &a) == 1)
  {
    zn = x*zn + a;
    pp=p;
    p = x*p + zn;
    /*printf("--- f(x)=%.10g, f'(x)=%.10g\n", zn, p);*/
  }
  /*printf("f(x)=%.10g, f'(x)=%.10g\n", zn, p);*/
  printf("%.10g\n%.10g\n", zn, pp);
}
