#include <stdio.h>

/*===================================*/
/*--Функция возвращает модуль числа--*/
/*===================================*/
double mod(double x)
{
  if (x>=0) return x;
  else return -x;
}

/*===================================*/
/*--Функция возвращает корень числа--*/
/*===================================*/
double SqrtE(double x, double E)
{
  double x0=1, x1;
  int i=0;
  x1=x0/2+x/x0/2;
  while (mod(x0-x1)>=E)
  {
    x0=x1;
    x1=x0/2+x/x0/2;
  }
  return x1;
}

/*===================================*/
/*--------------Main-----------------*/
/*===================================*/
int main()
{
  double x, E;
  scanf("%lf", &E);
  while (scanf("%lf", &x) == 1)
  {
    /*printf("E=%.10g x=%.10g res=%.10g\n", E, x, SqrtE(x, E));*/
    if (x<0)                  /*проверка на отрицательные числа*/
      return 1;
    printf("%.10g\n", SqrtE(x, E));
  }
}
